OpenFOAM/C395E/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
98304
(
(0.0251028 6.44689e-05 0.00227978)
(0.028837 8.97574e-05 0.00348638)
(0.0352762 2.38927e-05 0.00171781)
(0.0242772 -9.75242e-07 0.00521525)
(0.0209502 5.00766e-05 0.00400764)
(0.0296546 -4.24313e-05 0.00400375)
(0.0266558 2.46001e-05 0.00165085)
(0.0279817 -3.29861e-05 0.00314928)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sides1
    {
        type            cyclic;
    }
    sides2
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
