OpenFOAM/C395E/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

rm -f *.csv
rm -rf processor*

#------------------------------------------------------------------------------
