OpenFOAM/C395E/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//U_bulk=1.0
//Re_tau=395
//Re_bulk=13750

Ubar            (1.0 0 0);
transportModel  Newtonian;
nu              1.45454545e-04; // nu = (U_bulk*2delta)/Re_bulk

// ************************************************************************* //
