OpenFOAM/C395E/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 0.0 0.0)
    (6.4 0.0 0.0)
    (0.0 1.0 0.0)
    (6.4 1.0 0.0)
    (0.0 2.0 0.0)
    (6.4 2.0 0.0)
    (0.0 0.0 3.2)
    (6.4 0.0 3.2)
    (0.0 1.0 3.2)
    (6.4 1.0 3.2)
    (0.0 2.0 3.2)
    (6.4 2.0 3.2)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (32 48 32) simpleGrading (1 50 1)
    hex (2 3 5 4 8 9 11 10) (32 48 32) simpleGrading (1 0.02 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    sides1
    {
        type            cyclic;
        neighbourPatch  sides2;
        faces           ((0 2 3 1)(2 4 5 3));
    }
    sides2
    {
        type            cyclic;
        neighbourPatch  sides1;
        faces           ((6 7 9 8)(8 9 11 10));
    }

    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 3 9 7)(3 5 11 9));
    }
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 6 8 2)(2 8 10 4));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
