OpenFOAM/C395E/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5e+2; // 1e+5 step
deltaT          5e-3;
writeControl    timeStep;
writeInterval   1e+4;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    #includeFunc    residuals
    
    #includeFunc    "grad"
    #includeFunc    "Qfunction"
    #includeFunc    "turbulenceFields"
    #includeFunc    "writeCellCentres"
    
    #include    "fieldAverage"
}

libs
(
    "libmyTurbulenceModels.so"
    "libmyWallFunctions.so"
);

// ************************************************************************* //
