OpenFOAM/C395E/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAverage1
{
    // Mandatory entries
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    writeControl    writeTime;
    //timeStart       100;

    fields
    (
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }

        p
        {
            mean        on;
            prime2Mean  off;
            base        time;
        }
        
        turbulenceProperties:R
        {
            mean        on;
            prime2Mean  off;
            base        time;
        }

        gradU
        {
            mean        on;
            prime2Mean  off;
            base        time;
        }
    );
}


// ************************************************************************* //
