OpenFOAM/C395E/system/writeCellCentres
type            writeCellCentres;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;